# SQL 50

Ce notebook permets de r√©aliser tous les exercices SQL types entretiens

## üìçLes exos Select

##### 1757. Recyclable and Low Fat Products

<details>
  <summary>Enonc√©</summary>
  
 Table: Products

  ![table](images/exo1_table.png)

  product_id is the primary key (column with unique values) for this table.
  low_fats is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
  recyclable is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

  Write a solution to find the ids of products that are both low fat and recyclable.

  Return the result table in any order.

  ![table](images/exo1_exemple_1.png)
</details>

<details>
  <summary>R√©ponse </summary>
  
  SELECT product_id

  FROM Products 
  
  WHERE low_fats = "Y" AND recyclable = "Y";
</details>

##### 584. Find Customer Referee

<details>
  <summary>Enonc√©</summary>
  
  Table: Customer
    
  ![table](images/exo2_table.png)
  
  In SQL, id is the primary key column for this table.
  Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
  
  Find the names of the customer that are not referred by the customer with id = 2.
  
  Return the result table in any order.
  
  The result format is in the following example.

  


  ![table](images/exo2_exemple_2.png)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT name
    FROM Customer
    WHERE referee_id != 2 OR referee_id IS NULL;
</details>

##### 595. Big Countries

<details>
  <summary>Enonc√©</summary>
  
 Table: World

  ![table](images/exo3_table.jpg)

  name is the primary key (column with unique values) for this table.
  Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
  

  A country is big if:

  it has an area of at least three million (i.e., 3000000 km2), or
  it has a population of at least twenty-five million (i.e., 25000000).
  Write a solution to find the name, population, and area of the big countries.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo3_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT name, population, area
    FROM World
    WHERE area >= 3000000 OR population >= 25000000;
</details>

##### 1148. Article Views I

<details>
  <summary>Enonc√©</summary>
  
   Table: Views

  ![table](images/exo4_table.jpg)

  There is no primary key (column with unique values) for this table, the table may have duplicate rows.
  Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
  Note that equal author_id and viewer_id indicate the same person.
    

   Write a solution to find all the authors that viewed at least one of their own articles.

   Return the result table sorted by `id` in ascending order. The result format is in the following example

  ![table](images/exo4_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT DISTINCT author_id as id
    FROM Views
    WHERE author_id = viewer_id
    ORDER BY id;
</details>

##### 1683. Invalid Tweets

<details>
  <summary>Enonc√©</summary>
  
   Table: Tweets

  ![table](images/exo5_table.jpg)

  tweet_id is the primary key (column with unique values) for this table.
  content consists of characters on an American Keyboard, and no other special characters.
  This table contains all the tweets in a social media app.
 

  Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than `15`.

  Return the result table in any order.

  The result format is in the following example

  ![table](images/exo5_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT tweet_id
    FROM Tweets
    WHERE LENGTH(content)>15;
</details>

## üîóBasic Joins

##### 1378. Replace Employee ID With The Unique Identifier

<details>
  <summary>Enonc√©</summary>
  
   Table: Employees

  ![table](images/exo6_table1.jpg)

  id is the primary key (column with unique values) for this table.
  Each row of this table contains the id and the name of an employee in a company.

   Table: EmployeeUNI

   ![table](images/exo6_table2.jpg)

  (id, unique_id) is the primary key (combination of columns with unique values) for this table.
  Each row of this table contains the id and the corresponding unique id of an employee in the company.

  Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo6_exemple1.jpg)
  ![table](images/exo6_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT e.name, eu.unique_id
    FROM Employees e
    LEFT JOIN EmployeeUNI eu
    ON e.id = eu.id;
</details>

##### 1068. Product Sales Analysis I

<details>
  <summary>Enonc√©</summary>
  
   Table: Sales

  ![table](images/exo7_table1.jpg)

  (sale_id, year) is the primary key (combination of columns with unique values) of this table.
   product_id is a foreign key (reference column) to Product table.
   Each row of this table shows a sale on the product product_id in a certain year.
   Note that the price is per unit.

   Table: Product

   ![table](images/exo7_table2.jpg)

  product_id is the primary key (column with unique values) of this table.
  Each row of this table indicates the product name of each product.

  Write a solution to report the `product_name`, `year`, and `price` for each `sale_id` in the Sales table.

  Return the resulting table in any order.

  The result format is in the following example.

  ![table](images/exo7_exemple1.jpg)
  ![table](images/exo7_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT p.product_name, s.year, s.price
    FROM Product p
    RIGHT JOIN Sales s
    ON p.product_id = s.product_id;
</details>

##### 1581. Customer Who Visited but Did Not Make Any Transactions

<details>
  <summary>Enonc√©</summary>
  
   Table: Visits

  ![table](images/exo8_table1.jpg)

  visit_id is the column with unique values for this table.
  This table contains information about the customers who visited the mall

   Table: Transaction

   ![table](images/exo8_table2.jpg)

  transaction_id is column with unique values for this table.
  This table contains information about the transactions made during the visit_id. 

  Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

  Return the result table sorted in any order.

  The result format is in the following example.

  ![table](images/exo8_exemple1.jpg)
  ![table](images/exo8_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT v.customer_id, COUNT(v.visit_id) AS count_no_trans
    FROM Visits v
    LEFT JOIN Transactions t
    ON v.visit_id = t.visit_id
    WHERE t.transaction_id IS NULL
    GROUP BY v.customer_id;
</details>

##### 197. Rising Temperature

<details>
  <summary>Enonc√©</summary>
  
   Table: Weather

  ![table](images/exo9_table.jpg)

  id is the column with unique values for this table.
  There are no different rows with the same recordDate.
  This table contains information about the temperature on a certain day.

   Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

   Return the result table in any order.

   The result format is in the following example.

  ![table](images/exo9_exemple.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT w.id
    FROM Weather w
    LEFT JOIN Weather w1
    ON w.recordDate = DATE_ADD(w1.recordDate, INTERVAL 1 DAY)
    WHERE w.temperature>w1.temperature;

   OU
    
    SELECT w1.id
    FROM Weather w1, Weather w2
    WHERE DATEDIFF(w1.recordDate, w2.recordDate) = 1 AND w1.temperature > w2.temperature;
</details>

##### 1661. Average Time of Process per Machine

<details>
  <summary>Enonc√©</summary>
  
   Table: Activity

  ![table](images/exo10_table.jpg)

  The table shows the user activities for a factory website.
  (machine_id, process_id, activity_type) is the primary key (combination of columns with unique values) of this table.
  machine_id is the ID of a machine.
  process_id is the ID of a process running on the machine with ID machine_id.
  activity_type is an ENUM (category) of type ('start', 'end').
  timestamp is a float representing the current time in seconds.
  'start' means the machine starts the process at the given timestamp and 'end' means the machine ends the process at the given timestamp.
  The 'start' timestamp will always be before the 'end' timestamp for every (machine_id, process_id) pair.
  It is guaranteed that each (machine_id, process_id) pair has a 'start' and 'end' timestamp.

  There is a factory website that has several machines each running the same number of processes. Write a solution to find the average time each machine takes to complete a process.

  The time to complete a process is the 'end' timestamp minus the 'start' timestamp. The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.

  The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo10_exemple1.jpg)

  ![table](images/exo10_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT a.machine_id, ROUND(AVG(a2.timestamp-a.timestamp),3) as processing_time
    FROM Activity a, Activity a2
    WHERE a.machine_id = a2.machine_id AND a.activity_type = 'start' AND a2.activity_type = 'end'
    GROUP BY machine_id

   OU
    
    # Write your MySQL query statement below
    SELECT a.machine_id, ROUND(AVG(b.timestamp-a.timestamp),3) AS processing_time
    FROM Activity a
    JOIN Activity b
    ON a.machine_id = b.machine_id
    AND a.process_id = b.process_id
    AND a.activity_type = 'start'
    AND b.activity_type = 'end'
    GROUP BY machine_id;
</details>

##### 577. Employee Bonus